{
  "outputFile.comment": "The path to save the generated image",
  "outputFile.type": "string",
  "outputFile": "/home/nodeyez/nodeyez/imageoutput/halving.png",
  "colorGrid.comment": "The base color of the grid representing each block during one percent of a halving period, expressed as a Hexadecimal color specifier",
  "colorGrid.type": "string",
  "colorGrid": "#404040",
  "colorProgress.comment": "The color to denote progress bar and filled in blocks within a percent of halving period, expressed as a Hexadecimal color specifier",
  "colorProgress.type": "string",
  "colorProgress": "#40ff40",
  "colorTextFG.comment": "The color of the text expressed as a Hexadecimal color specifier",
  "colorTextFG.type": "string",
  "colorTextFG": "#ffffff",
  "colorBackground.comment": "The background color of the image expressed as a Hexadecimal color specifier",
  "colorBackground.type": "string",
  "colorBackground": "#000000",
  "gridImageEnabled.comment": "Indicates whether to render a graphic image into the grid. If enabled, will source images from the ipfsDirectory location, changing to a different image for each whole percent. Default `True`",
  "gridImageEnabled.type": "boolean",
  "gridImageEnabled": true,
  "gridImageUnminedMode.comment": "When gridImageEnabled is True, this controls how unmined blocks should appear. Recognized values are 'grayscale', 'dither', 'dither2'. Unrecognized values will result in full image being displayed in color. Default `grayscale`",
  "gridImageUnminedMode.type": "string",
  "gridImageUnmined": "grayscale",
  "ipfsDirectory.comment": "A directory to find image files. This is intended to leverage images downloaded as part of the raretoshi script. Default `/home/nodeyez/nodeyez/data/ipfs`",
  "ipfsDirectory.type": "string",
  "ipfsDirectory": "/home/nodeyez/nodeyez/data/ipfs",
  "fillGridDividersEnabled.comment": "This controls whether the lines between individual grid blocks should be filled as well when blocks are produced. Default `true`",
  "fillGridDividersEnabled.type": "boolean",
  "fillGridDividersEnabled": true,
  "width.comment": "The width, in pixels to generate the image. Default is 480",
  "width.type": "integer",
  "width": 480,
  "height.comment": "The height, in pixels to generate the image. Default is 320",
  "height.type": "integer",
  "height": 320,
  "sleepInterval.comment": "The amount of time, in seconds, the script should wait before data gathering and image creation again",
  "sleepInterval.type": "integer",
  "sleepInterval": 540
}
